<template>
  <section
    class="bg-white dark:bg-gray-800 p-8 md:p-12 rounded-xl shadow-xl animate-fade-in-up transform transition-transform duration-500 hover:scale-105 hover:shadow-2xl"
  >
    <h2 class="text-4xl font-bold tracking-tight text-center mb-8 text-gray-800 dark:text-gray-200">
      用户服务协议
    </h2>
    <div
      class="content-paragraph text-base leading-relaxed space-y-4 text-gray-700 dark:text-gray-300"
    >
      <p>
        欢迎您注册并使用本网站（以下简称“本平台”）提供的图片发布、浏览、管理服务！
        为保障您的合法权益，请您在注册成为用户前，务必认真阅读本协议全部内容。您在注册、登录、浏览、上传、下载、支付、评论等行为时，即表示您已阅读并同意遵守本协议中的所有条款。
        若您对协议内容有任何疑问，请及时与平台客服联系。
      </p>

      <h3 class="text-xl font-semibold text-gray-900 dark:text-gray-100 mb-2 mt-6">
        一、图片内容的版权归属与授权说明
      </h3>
      <p>
        1、用户在本平台上传的所有图片及其相关信息（包括但不限于标题、标签、描述、EXIF
        元数据等）由上传者本人负责，其应确保对该内容享有合法、完整的著作权或已取得合法授权。
      </p>
      <p>
        2、上传图片的用户须明确承诺：
        所上传的图片为其原创，或者已取得原著作权人或合法代理人的明确授权；
        上传内容不侵犯任何第三方的著作权、肖像权、商标权、名誉权、隐私权或其他合法权益；
        不得上传来源于商业图库、影视截图、动漫角色、品牌
        logo、明星肖像、网络转载图片等可能涉及侵权的内容，除非具有合法授权。
      </p>
      <p>
        3、用户在上传图片的同时，自动授予本平台一项全球范围内的、非独占、可转授权、免许可费的永久性授权，用于：
        在平台内展示与传播该图片； 通过平台系统生成缩略图、水印图；
        用于平台内容推荐、页面宣传、搜索结果呈现等相关服务；
        用于平台自身推广、运营与相关功能的展示与维护（包括但不限于首页、排行榜、专题推荐等。
      </p>

      <h3 class="text-xl font-semibold text-gray-900 dark:text-gray-100 mb-2 mt-6">
        二、用户注册与账户管理
      </h3>
      <p>为保证平台正常运营，本平台将采取必要措施：</p>
      <p>
        1、用户在使用本平台服务前，需完成注册流程并同意本协议。注册信息应真实、准确、完整，不得冒用他人身份。
      </p>
      <p>
        2、用户账户仅限本人使用，不得出租、出借、出售或转让。用户应妥善保管账号密码，因个人原因导致的账号被盗、信息泄露、积分/资金损失由用户自行承担责任。
      </p>
      <p>3、户如长期未登录、存在违法违规行为或被投诉多次，平台有权在通知或公告后暂停或注销账户。</p>

      <h3 class="text-xl font-semibold text-gray-900 dark:text-gray-100 mb-2 mt-6">
        三、内容上传规范
      </h3>
      <p>1、用户可在平台发布或上传图片，但上传前须确保该内容为本人原创，或已获得合法授权。</p>
      <p>
        2、禁止上传以下类型内容：含有侵犯他人版权、肖像权、商标权等第三方合法权益的图片；
        来源不明的网络图片、商用图库图、影视动漫截图、明星照片等；
        含有色情、暴力、恐怖、政治敏感等违法违规内容；
        含有恶意广告、水印篡改、诱导点击等信息的图片。
      </p>
      <p>
        3、用户对其上传的内容承担全部法律责任，平台对其合法性不做实质性审查，仅在用户申请公开时初步盛和检测，对违规内容进行初步判断，含有色情、暴力、恐怖、政治敏感，如确认违规，将进行删除、下架、屏蔽处理，造成损失或纠纷，平台不承担任何责任。
      </p>
      <h3 class="text-xl font-semibold text-gray-900 dark:text-gray-100 mb-2 mt-6">
        四、内容授权与平台使用权
      </h3>
      <p>
        1、用户在上传图片的同时，授予本平台全球范围内的非独占、永久、可转授权、免许可费的使用权，包括但不限于展示、压缩、加水印、推荐、运营推广等用途。
      </p>
      <p>2、用户上传图片不会转让版权，原始版权仍归用户本人所有。</p>
      <p>3、平台有权对上传内容进行内容识别、安全审核、分类标记、标签优化、推荐等技术处理。</p>
      <h3 class="text-xl font-semibold text-gray-900 dark:text-gray-100 mb-2 mt-6">
        五、知识产权保护
      </h3>
      <p>1、平台高度重视知识产权保护，鼓励原创内容。</p>
      <p>
        2、若您认为平台存在侵犯您合法权益的内容，请通过版权投诉通道（或邮件
        <a href="https://wx.mail.qq.com/" class="text-blue-600 dark:text-blue-400 hover:underline"
          >3217778348@qq.com</a
        >）进行举报，平台将在48小时内响应并处理。
      </p>
      <p>3、对于屡次上传侵权内容的用户，平台有权限制功能、冻结积分、关闭账户，并依法追责。</p>
      <h3 class="text-xl font-semibold text-gray-900 dark:text-gray-100 mb-2 mt-6">
        六、用户行为规范
      </h3>
      <p>
        1、用户在平台的所有行为须遵守国家法律法规，不得进行如下行为：
        散布违法、低俗、暴力、歧视、政治敏感等信息；
        通过机器人、外挂等手段批量发布内容或操纵浏览、点赞、下载；
        恶意发布虚假信息、诽谤他人、侵犯隐私； 通过平台进行诈骗、洗钱、非法交易等违法行为。
      </p>
      <p>
        2、用户行为若违反本协议，平台有权视情节轻重采取警告、限制功能、下架内容、注销账户等措施，并保留追究法律责任的权利。
      </p>
      <h3 class="text-xl font-semibold text-gray-900 dark:text-gray-100 mb-2 mt-6">七、免责声明</h3>
      <p>
        1、平台作为中立技术服务提供方，无法完全控制所有用户上传内容的合法性、真实性，亦不承担由此引发的版权、肖像权、商业利益等法律责任。
      </p>
      <p>
        2、因用户行为（如上传盗版图、非法下载后传播）引发的任何侵权纠纷，由行为用户自行承担全部责任，与平台无关。
      </p>
      <p>
        3、因系统维护、黑客攻击、服务中断等不可抗力原因导致的服务不可用或数据丢失，平台不承担赔偿责任，但将尽力协助恢复数据。
      </p>
      <h3 class="text-xl font-semibold text-gray-900 dark:text-gray-100 mb-2 mt-6">八、其他</h3>
      <p>
        1、本协议内容可由平台根据运营需要进行修订，修订后的协议将在平台首页或重要页面公告，或以系统通知等方式告知用户。
      </p>
      <p>2、用户继续使用服务即视为接受更新后的协议内容，若不同意，可主动注销账户并停止使用。</p>
      <p></p>
      <p>协议版本号：V1.0</p>
      <p>平台名称：LZ-Picture</p>
      <p>
        联系方式：<a
          href="https://wx.mail.qq.com/"
          class="text-blue-600 dark:text-blue-400 hover:underline"
          >3217778348@qq.com</a
        >
      </p>
      <p>发布日期：2025年08月01日</p>
    </div>
  </section>
</template>

<script setup lang="ts" name="CopyrightSection">
import './index.css'
</script>

<style scoped></style>
